Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.UseDetailedTorsors
Gets or sets the use detailed torsors option

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.UseLoadCasesIsAvailable
Returns true if the use load cases option is available, otherwise returns false

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.ExportIsAvailable
Returns true if the export option is available, otherwise returns false

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.ImportIsAvailable
Returns true if the import option is available, otherwise returns false

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.PresizeIsAvailable
Returns true if the presize is available, otherwise returns false

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.CheckIsAvailable
Returns true if the code check is available, otherwise returns false

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.ApprovalStatus
Gets of sets the approval status of the joint

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.NSAModuleInternalName
Returns the NSA module internal name

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.NewRuleTypeRunName
Returns rule run name

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.NSAModuleStandard
Returns NSA module standard

Autodesk.AdvanceSteel.ConstructionTypes.UserAutoConstructionObject.NSAModuleName
Returns NSA module name